Intro-To-Org.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Intro-To-Org</title>
<!-- 2016-09-01 Thu 22:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Amogh" />
</head>
<body>
<div id="content">
<h1 class="title">Intro-To-Org</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Preliminaries</a></li>
<li><a href="#sec-2">2. Welcome to Emacs!</a>
<ul>
<li><a href="#sec-2-1">2.1. Introduction</a></li>
<li><a href="#sec-2-2">2.2. Why Emacs?</a></li>
<li><a href="#sec-2-3">2.3. Some Emacs Basics</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Org: Organize your life in plain text</a>
<ul>
<li><a href="#sec-3-1">3.1. Some cool things that you can do with Org</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Org-ref: The answer to recording literature searches</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Preliminaries</h2>
<div class="outline-text-2" id="text-1">
<p>
This is my attempt at creating a non-specialist friendly introduction to the world of Emacs and Org-Mode. This document will continue to be modified.
The latest version of this document was created on <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-09-01 Thu&gt;</span></span>
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Welcome to Emacs!</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Introduction</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Hello there! This is my attempt to introduce the Emacs text editor to an average biologist, or more generally, any person who is not comfortable writing code, using the terminal (what's that??) or installing packages using a command line. I hope you can see the utility of Emacs over other methods of recording data, jotting down notes from papers that you might be reading, or even creating a document with multiple literature references in it. 
</p>

<p>
Read on is you are interested in learning about the coolest way to record and share science!
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Why Emacs?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This is the big question: Why EMACS? What is it that makes this text editor(which looks uglier than Notepad!) better than, say, Microsoft Word?
At first glance, the easiest answer to that question is that Emacs is a lot less <i>distracting</i> than Word. It is all plain text! This should already be a huge impetus to switch over; it is the <i>aesthetic</i>.
But going beyond looks, Emacs is an immensely versatile piece of software. Describing all its features is quite impossible for me, because, honestly, I don't even know what I don't know about Emacs. It is sufficient to know that <i>Emacs</i> stand for <b>Editor MACros</b>, and was originally developed as a set of <i>macros</i> or computer routines to automate text editor functions.
</p>

<p>
In a nutshell, <b>Emacs is built to be the most efficient text editor there is</b>. (Some might argue that it is VI or Nano. To these people I say, do not insult St. IGnucius.) 
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Some Emacs Basics</h3>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Org: Organize your life in plain text</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Some cool things that you can do with Org</h3>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Org-ref: The answer to recording literature searches</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Amogh</p>
<p class="date">Created: 2016-09-01 Thu 22:25</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
